class AppConstants {
  static const serviceTypeList = <String>[
    "Усунення дірки / латання",
    "Встановлення блискавки",
    "Заміна блискавки",
    "Підрубка низу (штанів, спідниці, сукні тощо)",
    "Вкорочення довжини (рукавів, штанів тощо)",
    "Подовження виробу",
    "Ремонт або встановлення кишень",
    "Ушивання виробу (по фігурі)",
    "Розширення виробу",
    "Заміна підкладки",
    "Підгонка по фігурі",
    "Встановлення гудзиків / кнопок / клепок",
    "Заміна гудзиків",
    "Встановлення люверсів",
    "Заміна елементів фурнітури (гачки, пряжки тощо)",
    "Ремонт швів",
    "Перешивання старого одягу",
    "Реставрація одягу",
    "Індивідуальне пошиття (на замовлення)",
    "Прасування / відпарювання",
    "Хімчистка"
  ];
}
